#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.5`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.local_file.file_system_prompt: Reading...[0m[0m
[0m[1mdata.local_file.file_system_prompt: Read complete after 0s [id=1b64caca607e392bc85ff27243e6022401cc3184][0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mmodule.azure_open_ai.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg][0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.azure_open_ai.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/assis-dev-uai001][0m
[0m[1mmodule.azure_open_ai.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.CognitiveServices/accounts/assis-dev-aoai001][0m
[0m[1mmodule.app_service_plan.azurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Web/serverFarms/assis-dev-asp001][0m
[0m[1mmodule.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.KeyVault/vaults/assis-dev-kv001][0m
[0m[1mmodule.application_insights.azurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Insights/components/assis-dev-ai001][0m
[0m[1mmodule.cosmosdb_account.azurerm_cosmosdb_account.cosmosdb_account: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.DocumentDB/databaseAccounts/assis-dev-cosmos001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dpml-nsg001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dpml-rt001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001][0m
[0m[1mazapi_resource.subnet_web_app: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/WebAppSubnet][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/DefaultResourceGroup-NEU/providers/Microsoft.OperationalInsights/workspaces/DefaultWorkspace-8f171ff9-2b5b-4f0f-aed5-7fa360a1d094-NEU][0m
[0m[1mmodule.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Reading...[0m[0m
[0m[1mmodule.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Web/serverFarms/assis-dev-asp001][0m
[0m[1mmodule.app_service_plan.azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan["0"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Web/serverFarms/assis-dev-asp001|applicationLogs-0][0m
[0m[1mmodule.azure_open_ai.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mazurerm_cognitive_deployment.cognitive_deployment_gpt_4o: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.CognitiveServices/accounts/assis-dev-aoai001/deployments/gpt-4o][0m
[0m[1mazurerm_role_assignment.uai_roleassignment_open_ai_contributor: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.CognitiveServices/accounts/assis-dev-aoai001/providers/Microsoft.Authorization/roleAssignments/a0b1ee09-399b-485f-21e1-29d2ca22343f][0m
[0m[1mmodule.cosmosdb_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cosmosdb_account: Reading...[0m[0m
[0m[1mazurerm_cosmosdb_sql_database.cosmosdb_sql_database: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.DocumentDB/databaseAccounts/assis-dev-cosmos001/sqlDatabases/BotDb][0m
[0m[1mmodule.azure_open_ai.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.CognitiveServices/accounts/assis-dev-aoai001][0m
[0m[1mmodule.azure_open_ai.azurerm_monitor_diagnostic_setting.diagnostic_setting_cognitive_account["0"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.CognitiveServices/accounts/assis-dev-aoai001|applicationLogs-0][0m
[0m[1mmodule.cosmosdb_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cosmosdb_account: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.DocumentDB/databaseAccounts/assis-dev-cosmos001][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mmodule.bot_service.data.azurerm_application_insights.application_insights: Reading...[0m[0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Insights/components/assis-dev-ai001][0m
[0m[1mmodule.bot_service.data.azurerm_application_insights.application_insights: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Insights/components/assis-dev-ai001][0m
[0m[1mmodule.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.KeyVault/vaults/assis-dev-kv001/providers/Microsoft.Authorization/roleAssignments/b739d992-3d17-8bb2-1bad-f440a8e0ed0d][0m
[0m[1mazurerm_role_assignment.uai_roleassignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.KeyVault/vaults/assis-dev-kv001/providers/Microsoft.Authorization/roleAssignments/d6139732-8ce2-0293-eb69-733d72f74ef2][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/PrivateEndpointSubnet][0m
[0m[1mmodule.azure_open_ai.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Network/privateEndpoints/assis-dev-aoai001-account-pe][0m
[0m[1mmodule.cosmosdb_account.azurerm_private_endpoint.private_endpoint_cosmosdb_account["Sql"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Network/privateEndpoints/assis-dev-cosmos001-Sql-pe][0m
[0m[1mmodule.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Network/privateEndpoints/assis-dev-kv001-vault-pe][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.KeyVault/vaults/assis-dev-kv001][0m
[0m[1mmodule.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.KeyVault/vaults/assis-dev-kv001|applicationLogs-0][0m
[0m[1mazurerm_linux_web_app.linux_web_app: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Web/sites/assis-dev-app001][0m
[0m[1mmodule.azure_open_ai.time_sleep.sleep_connectivity: Refreshing state... [id=2024-09-19T15:48:07Z][0m
[0m[1mmodule.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2024-09-19T15:49:47Z][0m
[0m[1mmodule.cosmosdb_account.time_sleep.sleep_connectivity: Refreshing state... [id=2024-09-19T15:59:25Z][0m
[0m[1mazurerm_private_endpoint.linux_web_app_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Network/privateEndpoints/assis-dev-app001-pe][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_linux_web_app: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Web/sites/assis-dev-app001|logAnalytics][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_linux_web_app[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_linux_web_app" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Web/sites/assis-dev-app001"
    }

[1m  # azurerm_bot_connection.bot_connection_aadv2_oauth[0m will be created
[0m  [32m+[0m[0m resource "azurerm_bot_connection" "bot_connection_aadv2_oauth" {
      [32m+[0m[0m bot_name              = "assis-dev-bot001"
      [32m+[0m[0m client_id             = (sensitive value)
      [32m+[0m[0m client_secret         = (sensitive value)
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m location              = "global"
      [32m+[0m[0m name                  = "aadv2-oauth"
      [32m+[0m[0m parameters            = {
          [32m+[0m[0m "tenantId" = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
        }
      [32m+[0m[0m resource_group_name   = "assis-dev-bot-rg"
      [32m+[0m[0m scopes                = "openid profile User.Read User.ReadBasic.All"
      [32m+[0m[0m service_provider_name = "Aadv2"
    }

[1m  # azurerm_linux_web_app.linux_web_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_linux_web_app" "linux_web_app" {
      [33m~[0m[0m app_settings                                   = {
          [33m~[0m[0m "AZURE_OPENAI_SYSTEM_PROMPT"                 = <<-EOT
                You are a world-class assistant who tells jokes. For anything but jokes, respond politely that you are just trying to make everyone’s life a happier place.
            EOT
            [90m# (18 unchanged elements hidden)[0m[0m
        }
        id                                             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Web/sites/assis-dev-app001"
        name                                           = "assis-dev-app001"
        tags                                           = {
            "workload" = "assis"
        }
        [90m# (24 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_linux_web_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_linux_web_app" {
        id                             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Web/sites/assis-dev-app001|logAnalytics"
        name                           = "logAnalytics"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log {
          [32m+[0m[0m eventhub_authorization_rule_id = (known after apply)
          [32m+[0m[0m eventhub_name                  = (known after apply)
          [32m+[0m[0m id                             = (known after apply)
          [32m+[0m[0m log_analytics_destination_type = (known after apply)
          [32m+[0m[0m log_analytics_workspace_id     = (known after apply)
          [32m+[0m[0m name                           = (known after apply)
          [32m+[0m[0m partner_solution_id            = (known after apply)
          [32m+[0m[0m storage_account_id             = (known after apply)
          [32m+[0m[0m target_resource_id             = (known after apply)
        } -> (known after apply)

      [33m~[0m[0m metric {
          [32m+[0m[0m eventhub_authorization_rule_id = (known after apply)
          [32m+[0m[0m eventhub_name                  = (known after apply)
          [32m+[0m[0m id                             = (known after apply)
          [32m+[0m[0m log_analytics_destination_type = (known after apply)
          [32m+[0m[0m log_analytics_workspace_id     = (known after apply)
          [32m+[0m[0m name                           = (known after apply)
          [32m+[0m[0m partner_solution_id            = (known after apply)
          [32m+[0m[0m storage_account_id             = (known after apply)
          [32m+[0m[0m target_resource_id             = (known after apply)
        } -> (known after apply)
    }

[1m  # module.application_insights.azurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_application_insights" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/DefaultResourceGroup-NEU/providers/Microsoft.OperationalInsights/workspaces/DefaultWorkspace-8f171ff9-2b5b-4f0f-aed5-7fa360a1d094-NEU"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.Insights/components/assis-dev-ai001"

      [32m+[0m[0m enabled_log {
          [32m+[0m[0m category_group = "allLogs"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [32m+[0m[0m metric {
          [32m+[0m[0m category = "AllMetrics"
          [32m+[0m[0m enabled  = true
        }
    }

[1m  # module.bot_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_bot_service_azure_bot[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_bot_service_azure_bot" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.bot_service.azurerm_bot_service_azure_bot.bot_service_azure_bot[0m will be created
[0m  [32m+[0m[0m resource "azurerm_bot_service_azure_bot" "bot_service_azure_bot" {
      [32m+[0m[0m developer_app_insights_application_id = "6e35c593-9977-4321-9e5a-297f2dfdc380"
      [32m+[0m[0m developer_app_insights_key            = "e694c55b-918b-48cd-bd92-c88cff7a045f"
      [32m+[0m[0m display_name                          = "Azure Bot Service - Assis Dev Bot001"
      [32m+[0m[0m endpoint                              = "https://assis-dev-app001.azurewebsites.net/api/messages"
      [32m+[0m[0m icon_url                              = "https://docs.botframework.com/static/devportal/client/images/bot-framework-default.png"
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m local_authentication_enabled          = false
      [32m+[0m[0m location                              = "global"
      [32m+[0m[0m luis_app_ids                          = []
      [32m+[0m[0m microsoft_app_id                      = "03256289-32cb-477f-b65f-6a0adf690356"
      [32m+[0m[0m microsoft_app_msi_id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/assis-dev-bot-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/assis-dev-uai001"
      [32m+[0m[0m microsoft_app_tenant_id               = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
      [32m+[0m[0m microsoft_app_type                    = "UserAssignedMSI"
      [32m+[0m[0m name                                  = "assis-dev-bot001"
      [32m+[0m[0m public_network_access_enabled         = true
      [32m+[0m[0m resource_group_name                   = "assis-dev-bot-rg"
      [32m+[0m[0m sku                                   = "S1"
      [32m+[0m[0m streaming_endpoint_enabled            = false
      [32m+[0m[0m tags                                  = {
          [32m+[0m[0m "workload" = "assis"
        }
    }

[1m  # module.bot_service.azurerm_monitor_diagnostic_setting.diagnostic_setting_bot_service_azure_bot["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_bot_service_azure_bot" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/DefaultResourceGroup-NEU/providers/Microsoft.OperationalInsights/workspaces/DefaultWorkspace-8f171ff9-2b5b-4f0f-aed5-7fa360a1d094-NEU"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.bot_service.azurerm_private_endpoint.bot_service_azure_bot_private_endpoint_bot[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "bot_service_azure_bot_private_endpoint_bot" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "assis-dev-bot001-bot-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "assis-dev-bot001-bot-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "assis-dev-bot-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/PrivateEndpointSubnet"
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "assis"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "assis-dev-bot001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.directline.botframework.com",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "assis-dev-bot001-bot-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "Bot",
            ]
        }
    }

[1m  # module.bot_service.azurerm_private_endpoint.bot_service_azure_bot_private_endpoint_token[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "bot_service_azure_bot_private_endpoint_token" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "assis-dev-bot001-token-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "assis-dev-bot001-token-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "assis-dev-bot-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/PrivateEndpointSubnet"
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "assis"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "assis-dev-bot001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.token.botframework.com",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "assis-dev-bot001-token-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "Token",
            ]
        }
    }

[1m  # module.bot_service.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "120s"
      [32m+[0m[0m id              = (known after apply)
    }

[1mPlan:[0m 7 to add, 2 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>